# DpartPhaseCreatedByOriginal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartPhaseCreatedByOriginal Property
ParameterTypeId Class See Also
---
"Phase Created By Original"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartPhaseCreatedByOriginal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartPhaseCreatedByOriginal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartPhaseCreatedByOriginal {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace